app/Controllers/Operateur/AuthController.php

    public function login()
    {
        $email = trim($this->request->getPost('email'));
        $password = $this->request->getPost('password');

        if (empty($email) || empty($password)) {
            return redirect()->back()
                ->withInput()
                ->with('error', 'Veuillez remplir tous les champs.');
        }

        $user = $this->userModel
            ->where('email', $email)
            ->where('role', 'admin')
            ->where('actif', 1)
            ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin1@mobilemoney.mg'
AND `role` = 'admin'
AND `actif` = 1
 LIMIT 1