app/Controllers/Operateur/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `clients`
WHERE `actif` = 1
SELECT SUM(`solde`) AS `solde`
FROM `clients`
 LIMIT 1
SELECT COUNT(*) AS `numrows` FROM `transactions`
SELECT SUM(`commission`) AS `commission`
FROM `transactions`
WHERE `type_operation_id` = 3
AND `autre_operateur_id` IS NOT NULL
 LIMIT 1
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/operateur/login');
        }

        $nombreClients = $this->clientModel
            ->where('actif', 1)
            ->countAllResults();

        $totalSolde = $this->clientModel
            ->selectSum('solde')
            ->first();

        $totalTransactions = $this->transactionModel->countAll();

        $totalFraisGlobal = $this->transactionModel->getTotalFrais();
        $totalCommissions = $this->transactionModel->getTotalCommissions();
        $totalGainsOperateur = $totalFraisGlobal - $totalCommissions;

        $typeOperations = $this->typeOperationModel->findAll();
        $fraisParType = [];
        foreach ($typeOperations as $type) {
            $frais = $this->transactionModel->getTotalFrais($type['id']);
            $commissions = 0.0;

            if ($type['nom'] === 'Transfert') {
                $commissions = $this->transactionModel->where('type_operation_id', $type['id'])
                    ->where('autre_operateur_id !=', null)
                    ->selectSum('commission')
                    ->first();

SELECT *
FROM `clients`
WHERE `actif` = 1
ORDER BY `solde` DESC
---

        $montantsParAutreOperateur = $this->transactionModel->getMontantsParAutreOperateur();

        $clients = $this->clientModel
            ->where('actif', 1)
            ->orderBy('solde', 'DESC')
            ->findAll();