app/Controllers/Operateur/HistoriqueTransfertController.php

SELECT *
FROM `transactions`
WHERE `type_operation_id` = 3
ORDER BY `date_transaction` DESC
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
SELECT *
FROM `clients`
WHERE `clients`.`id` = 5
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/operateur/login');
        }

        $transfertId = $this->typeOperationModel->getIdByNom('Transfert');

        $transfers = $this->transactionModel
            ->where('type_operation_id', $transfertId)
            ->orderBy('date_transaction', 'DESC')
            ->findAll();

        $operateurs = [];
        foreach ($transfers as &$t) {
            $expediteur   = $this->clientModel->find($t['expediteur_id']);
            $destinataire = $this->clientModel->find($t['destinataire_id']);