app/Controllers/Operateur/PrefixeController.php

SELECT *
FROM `prefixes`
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/operateur/login');
        }

        $prefixes = $this->prefixeModel->findAll();