app/Controllers/Operateur/SituationGainController.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/operateur/login');
        }

        $totalFraisGlobal = $this->transactionModel->getTotalFrais();
        $totalCommissions = $this->transactionModel->getTotalCommissions();
        $totalGainsOperateur = $totalFraisGlobal - $totalCommissions;

        $typeOperations = $this->typeOperationModel->findAll();
        $detailsParType = [];
        foreach ($typeOperations as $type) {
            $frais = $this->transactionModel->getTotalFrais($type['id']);
            $commissions = 0.0;

            if ($type['nom'] === 'Transfert') {
                $commissions = $this->transactionModel->where('type_operation_id', $type['id'])
                    ->where('autre_operateur_id !=', null)
                    ->selectSum('commission')
                    ->first();
---
SELECT SUM(`commission`) AS `commission`
FROM `transactions`
WHERE `type_operation_id` = 3
AND `autre_operateur_id` IS NOT NULL
 LIMIT 1