app/Controllers/BaseClientController.php

    protected function getClientConnecte()
    {
        if (! $this->estConnecte()) {
            return null;
        }

        return $this->clientModel->find($this->session->get('client_id'));
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1