app/Controllers/HistoriqueController.php

    public function index()
    {
        if ($redirect = $this->exigerConnexion()) {
            return $redirect;
        }

        $client = $this->getClientConnecte();

        $typeOperationId = $this->request->getGet('type');
        $ordre = $this->request->getGet('ordre') === 'ASC' ? 'ASC' : 'DESC';

        $transaction = new TransactionModel();
        $operations  = $transaction->getHistorique($client['id'], $typeOperationId ? (int) $typeOperationId : null, $ordre);

        $typeOperationModel = new TypeOperationModel();
        $clientModel        = new ClientModel();
        $types = $typeOperationModel->findAll();

        $referencesMultiples = $this->getReferencesMultiples($operations);

        foreach ($operations as &$op) {
            $type = $typeOperationModel->find($op['type_operation_id']);
            $op['type_libelle'] = $type ? $type['nom'] : 'Inconnu';

            $expediteur   = $clientModel->find($op['expediteur_id']);
            $destinataire = $clientModel->find($op['destinataire_id']);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
SELECT *
FROM `clients`
WHERE `clients`.`id` = 5