app/Controllers/TransfertController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
INSERT INTO `transactions` (`type_operation_id`, `expediteur_id`, `destinataire_id`, `montant`, `frais`, `description`) VALUES (3, 1, 3, 176500, 2000, 'Transfert vers 0324567890')
---
    public function store()
    {
        if ($redirect = $this->exigerConnexion()) {
            return $redirect;
        }

        $client = $this->getClientConnecte();

        $destinataire = $this->normaliserTelephone($this->request->getPost('destinataire'));
        $montant      = (float) $this->request->getPost('montant');

        if (! $this->validerTransfert($client, $destinataire, $montant, $erreur)) {
            return redirect()->back()->withInput()->with('error', $erreur);
        }

        $destinataireClient = $this->clientModel->getClientByTelephone($destinataire);
        if (! $destinataireClient) {
            $destinataireClient = $this->clientModel->creerClient($destinataire);
        }

        $typeOperationId = $this->getTypeTransfertId();

        $bareme = new BaremeFraisModel();
        $frais  = $bareme->calculerFrais($typeOperationId, $montant);
        $total  = $montant + $frais;

        $this->clientModel->debiter($client['id'], $total);
        $this->clientModel->crediter($destinataireClient['id'], $montant);

        $nouveauSolde = $this->clientModel->find($client['id'])['solde'];

        $transaction = new TransactionModel();
        $transaction->insert([
            'type_operation_id' => $typeOperationId,
            'expediteur_id'     => $client['id'],
            'destinataire_id'   => $destinataireClient['id'],
            'montant'           => $montant,
            'frais'             => $frais,
            'description'       => 'Transfert vers ' . $destinataire,
        ]);