app/Models/BaremeFraisModel.php

SELECT `baremes_frais`.*, `types_operations`.`nom` as `type_nom`
FROM `baremes_frais`
JOIN `types_operations` ON `types_operations`.`id` = `baremes_frais`.`type_operation_id`
ORDER BY `type_operation_id` ASC, `montant_min` ASC
---
    public function getWithTypeName()
    {
        return $this->select('baremes_frais.*, types_operations.nom as type_nom')
                     ->join('types_operations', 'types_operations.id = baremes_frais.type_operation_id')
                     ->orderBy('type_operation_id', 'ASC')
                     ->orderBy('montant_min', 'ASC')
                     ->findAll();