app/Models/ClientModel.php

    public function getClientByTelephone(string $telephone)
    {
        return $this->where('telephone', $telephone)->first();
---
SELECT *
FROM `clients`
WHERE `telephone` = '0331234567'
 LIMIT 1

    public function crediter(int $id, float $montant): bool
    {
        return $this->set('solde', 'solde + ' . $montant, false)
                    ->where('id', $id)
                    ->update();
---
UPDATE `clients` SET `solde` = solde + 176500
WHERE `id` = 3

    public function debiter(int $id, float $montant): bool
    {
        return $this->set('solde', 'solde - ' . $montant, false)
                    ->where('id', $id)
                    ->update();
---
UPDATE `clients` SET `solde` = solde - 178500
WHERE `id` = 1