app/Models/TransactionModel.php

SELECT *
FROM `transactions`
WHERE `expediteur_id` = 1
OR `destinataire_id` = 1
ORDER BY `date_transaction` DESC
 LIMIT 1
---
    public function getDerniereOperation(int $clientId)
    {
        return $this->where('expediteur_id', $clientId)
                    ->orWhere('destinataire_id', $clientId)
                    ->orderBy('date_transaction', 'DESC')
                    ->first();

SELECT *
FROM `transactions`
WHERE `expediteur_id` = 1
OR `destinataire_id` = 1
ORDER BY `date_transaction` DESC
---
    public function getHistorique(int $clientId, ?int $typeOperationId = null, string $ordre = 'DESC')
    {
        $builder = $this->where('expediteur_id', $clientId)
                        ->orWhere('destinataire_id', $clientId);

        if (! empty($typeOperationId)) {
            $builder->where('type_operation_id', $typeOperationId);
        }

        $builder->orderBy('date_transaction', $ordre);

        return $builder->findAll();

SELECT SUM(`frais`) AS `frais`
FROM `transactions`
WHERE `type_operation_id` = 1
 LIMIT 1
---
    public function getTotalFrais(?int $typeOperationId = null): float
    {
        $builder = $this->selectSum('frais');

        if (! empty($typeOperationId)) {
            $builder->where('type_operation_id', $typeOperationId);
        }

        $result = $builder->first();

SELECT SUM(`commission`) AS `commission`
FROM `transactions`
 LIMIT 1
---
    public function getTotalCommissions(): float
    {
        $result = $this->selectSum('commission')->first();

SELECT `autres_operateurs`.`nom`, SUM(transactions.montant) as total_montant, SUM(transactions.commission) as total_commission
FROM `transactions`
JOIN `autres_operateurs` ON `autres_operateurs`.`id` = `transactions`.`autre_operateur_id`
WHERE `transactions`.`autre_operateur_id` IS NOT NULL
GROUP BY `transactions`.`autre_operateur_id`
---
    public function getMontantsParAutreOperateur(): array
    {
        return $this->select('autres_operateurs.nom, SUM(transactions.montant) as total_montant, SUM(transactions.commission) as total_commission')
                     ->join('autres_operateurs', 'autres_operateurs.id = transactions.autre_operateur_id')
                     ->where('transactions.autre_operateur_id !=', null)
                     ->groupBy('transactions.autre_operateur_id')
                     ->findAll();